Revit 2027 API
PreviewControl Events
The PreviewControl type exposes the following members.
Events
Name | Description
ContextMenuClosing | Occurs just before any context menu on the element is closed.
(Inherited from FrameworkElement)
ContextMenuOpening | Occurs when any context menu on the element is opened.
(Inherited from FrameworkElement)
DataContextChanged | Occurs when the data context for this element changes.
(Inherited from FrameworkElement)
DragEnter | Occurs when the input system reports an underlying drag event with this element as the drag target.
(Inherited from UIElement)
DragLeave | Occurs when the input system reports an underlying drag event with this element as the drag origin.
(Inherited from UIElement)
DragOver | Occurs when the input system reports an underlying drag event with this element as the potential drop target.
(Inherited from UIElement)
Drop | Occurs when the input system reports an underlying drop event with this element as the drop target.
(Inherited from UIElement)
FocusableChanged | Occurs when the value of the Focusable property changes.
(Inherited from UIElement)
GiveFeedback | Occurs when the input system reports an underlying drag-and-drop event that involves this element.
(Inherited from UIElement)
GotFocus | Occurs when this element gets logical focus.
(Inherited from UIElement)
GotKeyboardFocus | Occurs when the keyboard is focused on this element.
(Inherited from UIElement)
GotMouseCapture | Occurs when this element captures the mouse.
(Inherited from UIElement)
GotStylusCapture | Occurs when this element captures the stylus.
(Inherited from UIElement)
GotTouchCapture | Occurs when a touch is captured to this element.
(Inherited from UIElement)
Initialized | Occurs when this FrameworkElement is initialized. This event coincides with cases where the value of the IsInitialized property changes from false (or undefined) to true.
(Inherited from FrameworkElement)
IsEnabledChanged | Occurs when the value of the IsEnabled property on this element changes.
(Inherited from UIElement)
IsHitTestVisibleChanged | Occurs when the value of the IsHitTestVisible dependency property changes on this element.
(Inherited from UIElement)
IsKeyboardFocusedChanged | Occurs when the value of the IsKeyboardFocused property changes on this element.
(Inherited from UIElement)
IsKeyboardFocusWithinChanged | Occurs when the value of the IsKeyboardFocusWithin property changes on this element.
(Inherited from UIElement)
IsMouseCapturedChanged | Occurs when the value of the IsMouseCaptured property changes on this element.
(Inherited from UIElement)
IsMouseCaptureWithinChanged | Occurs when the value of the IsMouseCaptureWithinProperty changes on this element.
(Inherited from UIElement)
IsMouseDirectlyOverChanged | Occurs when the value of the IsMouseDirectlyOver property changes on this element.
(Inherited from UIElement)
IsStylusCapturedChanged | Occurs when the value of the IsStylusCaptured property changes on this element.
(Inherited from UIElement)
IsStylusCaptureWithinChanged | Occurs when the value of the IsStylusCaptureWithin property changes on this element.
(Inherited from UIElement)
IsStylusDirectlyOverChanged | Occurs when the value of the IsStylusDirectlyOver property changes on this element.
(Inherited from UIElement)
IsVisibleChanged | Occurs when the value of the IsVisible property changes on this element.
(Inherited from UIElement)
KeyDown | Occurs when a key is pressed while focus is on this element.
(Inherited from UIElement)
KeyUp | Occurs when a key is released while focus is on this element.
(Inherited from UIElement)
LayoutUpdated | Occurs when the layout of the various visual elements associated with the current Dispatcher changes.
(Inherited from UIElement)
Loaded | Occurs when the element is laid out, rendered, and ready for interaction.
(Inherited from FrameworkElement)
LostFocus | Occurs when this element loses logical focus.
(Inherited from UIElement)
LostKeyboardFocus | Occurs when the keyboard is no longer focused on this element.
(Inherited from UIElement)
LostMouseCapture | Occurs when this element loses mouse capture.
(Inherited from UIElement)
LostStylusCapture | Occurs when this element loses stylus capture.
(Inherited from UIElement)
LostTouchCapture | Occurs when this element loses a touch capture.
(Inherited from UIElement)
ManipulationBoundaryFeedback | Occurs when the manipulation encounters a boundary.
(Inherited from UIElement)
ManipulationCompleted | Occurs when a manipulation and inertia on the UIElement object is complete.
(Inherited from UIElement)
ManipulationDelta | Occurs when the input device changes position during a manipulation.
(Inherited from UIElement)
ManipulationInertiaStarting | Occurs when the input device loses contact with the UIElement object during a manipulation and inertia begins.
(Inherited from UIElement)
ManipulationStarted | Occurs when an input device begins a manipulation on the UIElement object.
(Inherited from UIElement)
ManipulationStarting | Occurs when the manipulation processor is first created.
(Inherited from UIElement)
MouseDoubleClick | Occurs when a mouse button is clicked two or more times.
(Inherited from Control)
MouseDown | Occurs when any mouse button is pressed while the pointer is over this element.
(Inherited from UIElement)
MouseEnter | Occurs when the mouse pointer enters the bounds of this element.
(Inherited from UIElement)
MouseLeave | Occurs when the mouse pointer leaves the bounds of this element.
(Inherited from UIElement)
MouseLeftButtonDown | Occurs when the left mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
MouseLeftButtonUp | Occurs when the left mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
MouseMove | Occurs when the mouse pointer moves while over this element.
(Inherited from UIElement)
MouseRightButtonDown | Occurs when the right mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
MouseRightButtonUp | Occurs when the right mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
MouseUp | Occurs when any mouse button is released over this element.
(Inherited from UIElement)
MouseWheel | Occurs when the user rotates the mouse wheel while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewDragEnter | Occurs when the input system reports an underlying drag event with this element as the drag target.
(Inherited from UIElement)
PreviewDragLeave | Occurs when the input system reports an underlying drag event with this element as the drag origin.
(Inherited from UIElement)
PreviewDragOver | Occurs when the input system reports an underlying drag event with this element as the potential drop target.
(Inherited from UIElement)
PreviewDrop | Occurs when the input system reports an underlying drop event with this element as the drop target.
(Inherited from UIElement)
PreviewGiveFeedback | Occurs when a drag-and-drop operation is started.
(Inherited from UIElement)
PreviewGotKeyboardFocus | Occurs when the keyboard is focused on this element.
(Inherited from UIElement)
PreviewKeyDown | Occurs when a key is pressed while focus is on this element.
(Inherited from UIElement)
PreviewKeyUp | Occurs when a key is released while focus is on this element.
(Inherited from UIElement)
PreviewLostKeyboardFocus | Occurs when the keyboard is no longer focused on this element.
(Inherited from UIElement)
PreviewMouseDoubleClick | Occurs when a user clicks the mouse button two or more times.
(Inherited from Control)
PreviewMouseDown | Occurs when any mouse button is pressed while the pointer is over this element.
(Inherited from UIElement)
PreviewMouseLeftButtonDown | Occurs when the left mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseLeftButtonUp | Occurs when the left mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseMove | Occurs when the mouse pointer moves while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseRightButtonDown | Occurs when the right mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseRightButtonUp | Occurs when the right mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseUp | Occurs when any mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseWheel | Occurs when the user rotates the mouse wheel while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewQueryContinueDrag | Occurs when there is a change in the keyboard or mouse button state during a drag-and-drop operation.
(Inherited from UIElement)
PreviewStylusButtonDown | Occurs when the stylus button is pressed while the pointer is over this element.
(Inherited from UIElement)
PreviewStylusButtonUp | Occurs when the stylus button is released while the pointer is over this element.
(Inherited from UIElement)
PreviewStylusDown | Occurs when the stylus touches the digitizer while it is over this element.
(Inherited from UIElement)
PreviewStylusInAirMove | Occurs when the stylus moves over an element without actually touching the digitizer.
(Inherited from UIElement)
PreviewStylusInRange | Occurs when the stylus is close enough to the digitizer to be detected, while over this element.
(Inherited from UIElement)
PreviewStylusMove | Occurs when the stylus moves while over the element. The stylus must move while being detected by the digitizer to raise this event, otherwise, PreviewStylusInAirMove is raised instead.
(Inherited from UIElement)
PreviewStylusOutOfRange | Occurs when the stylus is too far from the digitizer to be detected.
(Inherited from UIElement)
PreviewStylusSystemGesture | Occurs when a user performs one of several stylus gestures.
(Inherited from UIElement)
PreviewStylusUp | Occurs when the user raises the stylus off the digitizer while the stylus is over this element.
(Inherited from UIElement)
PreviewTextInput | Occurs when this element gets text in a device-independent manner.
(Inherited from UIElement)
PreviewTouchDown | Occurs when a finger touches the screen while the finger is over this element.
(Inherited from UIElement)
PreviewTouchMove | Occurs when a finger moves on the screen while the finger is over this element.
(Inherited from UIElement)
PreviewTouchUp | Occurs when a finger is raised off of the screen while the finger is over this element.
(Inherited from UIElement)
QueryContinueDrag | Occurs when there is a change in the keyboard or mouse button state during a drag-and-drop operation.
(Inherited from UIElement)
QueryCursor | Occurs when the cursor is requested to display. This event is raised on an element each time that the mouse pointer moves to a new location, which means the cursor object might need to be changed based on its new position.
(Inherited from UIElement)
RequestBringIntoView | Occurs when BringIntoView(Rect) is called on this element.
(Inherited from FrameworkElement)
SizeChanged | Occurs when either the ActualHeight or the ActualWidth properties change value on this element.
(Inherited from FrameworkElement)
SourceUpdated | Occurs when the source value changes for any existing property binding on this element.
(Inherited from FrameworkElement)
StylusButtonDown | Occurs when the stylus button is pressed while the pointer is over this element.
(Inherited from UIElement)
StylusButtonUp | Occurs when the stylus button is released while the pointer is over this element.
(Inherited from UIElement)
StylusDown | Occurs when the stylus touches the digitizer while the stylus is over this element.
(Inherited from UIElement)
StylusEnter | Occurs when the stylus enters the bounds of this element.
(Inherited from UIElement)
StylusInAirMove | Occurs when the stylus moves over an element without actually touching the digitizer.
(Inherited from UIElement)
StylusInRange | Occurs when the stylus is close enough to the digitizer to be detected, while over this element.
(Inherited from UIElement)
StylusLeave | Occurs when the stylus leaves the bounds of the element.
(Inherited from UIElement)
StylusMove | Occurs when the stylus moves over this element. The stylus must move while on the digitizer to raise this event. Otherwise, StylusInAirMove is raised instead.
(Inherited from UIElement)
StylusOutOfRange | Occurs when the stylus is too far from the digitizer to be detected, while over this element.
(Inherited from UIElement)
StylusSystemGesture | Occurs when a user performs one of several stylus gestures.
(Inherited from UIElement)
StylusUp | Occurs when the user raises the stylus off the digitizer while it is over this element.
(Inherited from UIElement)
TargetUpdated | Occurs when the target value changes for any property binding on this element.
(Inherited from FrameworkElement)
TextInput | Occurs when this element gets text in a device-independent manner.
(Inherited from UIElement)
ToolTipClosing | Occurs just before any tooltip on the element is closed.
(Inherited from FrameworkElement)
ToolTipOpening | Occurs when any tooltip on the element is opened.
(Inherited from FrameworkElement)
TouchDown | Occurs when a finger touches the screen while the finger is over this element.
(Inherited from UIElement)
TouchEnter | Occurs when a touch moves from outside to inside the bounds of this element.
(Inherited from UIElement)
TouchLeave | Occurs when a touch moves from inside to outside the bounds of this element.
(Inherited from UIElement)
TouchMove | Occurs when a finger moves on the screen while the finger is over this element.
(Inherited from UIElement)
TouchUp | Occurs when a finger is raised off of the screen while the finger is over this element.
(Inherited from UIElement)
Unloaded | Occurs when the element is removed from within an element tree of loaded elements.
(Inherited from FrameworkElement)
Top
See Also
Reference
PreviewControl Class
Autodesk.Revit.UI Namespace